// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// 452 -> 11

// 82 -> 10

// 9012 -> 12

using static Library;

int number = Input();
int sum = Sum(number);
Console.WriteLine("Сумма цифр в числе: " + sum);

